brew "eza"
brew "just"
brew "neovim"
brew "node@22", link: true
brew "spaceship"
brew "starship"
brew "stow"
brew "telnet"
cask "cyberduck"
cask "firefox@developer-edition"
cask "font-jetbrains-mono"
cask "ghostty"
cask "itsycal"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "visual-studio-code"
cask "zed"
vscode "wayou.vscode-todo-highlight"
