# Brewfile for macOS development environment

# Azure cloud CLI
brew "azure-cli"
# Cloudflare Tunnel client
brew "cloudflared"
# Environment variable management per directory
brew "direnv"
# Modern ls replacement
brew "eza"
# Fast find alternative
brew "fd"
# Fuzzy finder
brew "fzf"
# Markdown viewer
brew "glow"
# Blog SSG
brew "hugo"
# Command runner (like make)
brew "just"
# Lua package manager
brew "luarocks"
# Text editor
brew "neovim"
# JavaScript runtime
brew "node@22", link: true
# Fast grep alternative
brew "ripgrep"
# Shell prompt
brew "starship"
# Symlink manager for dotfiles
brew "stow"
# Network diagnostic tool
brew "telnet"
# Terminal multiplexer
brew "tmux"
# uv
brew "uv"
# Smart directory jumper
brew "zoxide"

# macOS window switcher
cask "alt-tab"
# SFTP/FTP client
cask "cyberduck"
# Database IDE
cask "dbeaver-community"
# Firefox DevTools
cask "firefox@developer-edition"
# Monospace font
cask "font-jetbrains-mono"
# Terminal emulator
cask "ghostty"
# Menubar calendar
cask "itsycal"
# Vector drawing
cask "monodraw"
# Code editor
cask "visual-studio-code"
# Terminal emulator
cask "wezterm"
# Code editor
cask "zed"
# Privacy-focused browser
cask "zen"


# Required for work

# Updates for Office apps
cask "microsoft-auto-update"
# Excel for spreadsheets
cask "microsoft-excel"
# Outlook for emails
cask "microsoft-outlook"
# Word for docs
cask "microsoft-word"
# Windows App for macOS
cask "windows-app"

