# Brewfile

# things that I don't install via brew
# - pi - check https://pi.dev/docs/latest/quickstart#install

# --- CLI Tools ---

# Prompt
brew "starship"                 # Shell prompt
# Replacement for ls - I use it only for custom `l` alias
brew "eza"
# View markdown files on terminal - want to replace this with neovim
brew "glow"
# Replacement for make - I use for hrmnjt/dev and other projects
brew "just"
# Fuzzy finder for custom tools and other
brew "fzf"
# Replacement for grep that I use for neovim
brew "ripgrep"
# Replacement for find - still trying to find more use of it
brew "fd"

# Editor
brew "neovim"

# Primarily for github.com/hrmnjt/dev
brew "stow"

# Install uv to install python and other py libraries
brew "uv"
# Node.js (unpinned now)
brew "node"
# SSG for hrmnjt/sttp
brew "hugo"

# DB
# SQL analytics - exploring as a replacement for heavy data work
brew "duckdb"
# Document format converter - mostly for markdown to other formats
brew "pandoc"
# Plain-text accounting - tracking personal finances
brew "hledger"

# Network
# Tunnel to expose local services - primarily for pi sandbox
brew "cloudflared"

# Virtualization (Gondolin sandbox)
# VM emulator for Gondolin sandbox in pi
brew "qemu"
# Compression lib needed for Gondolin custom image builds
brew "lz4"
# ext4 filesystem tools needed for Gondolin custom image builds
brew "e2fsprogs"

# Media
# Audio/video processing - occasionally needed for media tasks
brew "ffmpeg"

# Experimental
# MacOS containers - trying out
brew "container"
# AI coding agent - trying out
brew "anomalyco/tap/opencode"
# Code review tool from modem-dev - trying out
brew "modem-dev/tap/hunk"

# --- GUI Apps ---

# Terminal
cask "ghostty"

# Editors - occasional use for paired programming or debugging
cask "visual-studio-code"
cask "zed"

# Browser - trying out brave, waiting for ladybird
cask "brave-browser"

# AI
cask "claude-code"			# Clawde on terminal

# Utilities
cask "alt-tab"
cask "itsycal"
cask "monodraw"
cask "obsidian"				# trying out an experimental excalidraw

# Fonts
cask "font-jetbrains-mono"

# =============================================================================
# Work (Required for DoH)
# =============================================================================

# --- CLI Tools ---
brew "azure-cli"
brew "databricks/tap/databricks"
brew "telnet"

# --- GUI Apps ---
cask "cyberduck"
cask "dbeaver-community"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-word"
cask "windows-app"
