# Brewfile

# =============================================================================
# CLI Tools
# =============================================================================

# Shell & Prompt
brew "starship"                 # Shell prompt
brew "zoxide"                   # Smart directory jumper
brew "direnv"                   # Environment variable management per directory

# File & Text Tools
brew "eza"                      # Modern ls replacement
brew "fd"                       # Fast find alternative
brew "fzf"                      # Fuzzy finder
brew "ripgrep"                  # Fast grep alternative
brew "glow"                     # Markdown viewer

# Development
brew "neovim"                   # Text editor
brew "just"                     # Command runner (like make)
brew "stow"                     # Symlink manager for dotfiles
brew "tmux"                     # Terminal multiplexer
brew "node"

brew "uv"                       # Python package manager
brew "gh"                       # Github CLI
brew "luarocks"                 # Lua package manager
brew "hugo"                     # Blog SSG
brew "duckdb"
brew "qemu"                     # Virtualization for Gondolin sandbox
brew "sinelaw/fresh/fresh-editor" # another terminal editor that I'm trying

# Media
brew "ffmpeg"                   # Image/video editor
brew "pandoc"                   # Swiss army knife for document conversion

# Cloud & Network
brew "azure-cli"                # Azure cloud CLI
brew "cloudflared"              # Cloudflare Tunnel client
brew "telnet"                   # Network diagnostic tool

# Experimental
brew "container"                # MacOS containers
brew "anomalyco/tap/opencode"
brew "hledger"
tap "databricks/tap"
brew "databricks/tap/databricks" # Databricks CLI

# =============================================================================
# GUI Applications (Casks)
# =============================================================================

# Terminals
cask "ghostty"                  # Terminal emulator
cask "wezterm"                  # Terminal emulator

# Editors
cask "visual-studio-code"       # Code editor
cask "zed"                      # Code editor

# Browsers
cask "firefox@developer-edition" # Firefox
cask "orion"                    # Browser
cask "zen"                      # Privacy-focused browser
cask "brave-browser"			# trying out brave, waiting for ladybird

# Utilities
cask "alt-tab"                  # macOS window switcher
cask "itsycal"                  # Menubar calendar
cask "cyberduck"                # SFTP/FTP client
cask "dbeaver-community"        # Database IDE
cask "monodraw"                 # Vector drawing
cask "obsidian"                 # trying out an experimental excalidraw
cask "claude-code"				# Clawde on terminal

# Fonts
cask "font-jetbrains-mono"      # Monospace font

# =============================================================================
# Work (Required for DoH)
# =============================================================================

cask "microsoft-auto-update"    # Updates for Office apps
cask "microsoft-excel"          # Excel for spreadsheets
cask "microsoft-outlook"        # Outlook for emails
cask "microsoft-word"           # Word for docs
cask "windows-app"              # Windows App for macOS
